mm399-dev-sw/micropython-tiva/ports/tm4c123/mods/pwm.c
/*
 * This file is part of the Micro Python project, http://micropython.org/
 *
 * The MIT License (MIT)
 *
 * Copyright (c) 2016-2021 Damien P. George
 * Copyright (c) 2018 Alan Dragomirecky
 * Copyright (c) 2020 Antoine Aubert
 * Copyright (c) 2021 Ihor Nehrutsa
 *
 * Permission is hereby granted, free of charge, to any person obtaining a copy
 * of this software and associated documentation files (the "Software"), to deal
 * in the Software without restriction, including without limitation the rights
 * to use, copy, modify, merge, publish, distribute, sublicense, and/or sell
 * copies of the Software, and to permit persons to whom the Software is
 * furnished to do so, subject to the following conditions:
 *
 * The above copyright notice and this permission notice shall be included in
 * all copies or substantial portions of the Software.
 *
 * THE SOFTWARE IS PROVIDED "AS IS", WITHOUT WARRANTY OF ANY KIND, EXPRESS OR
 * IMPLIED, INCLUDING BUT NOT LIMITED TO THE WARRANTIES OF MERCHANTABILITY,
 * FITNESS FOR A PARTICULAR PURPOSE AND NONINFRINGEMENT. IN NO EVENT SHALL THE
 * AUTHORS OR COPYRIGHT HOLDERS BE LIABLE FOR ANY CLAIM, DAMAGES OR OTHER
 * LIABILITY, WHETHER IN AN ACTION OF CONTRACT, TORT OR OTHERWISE, ARISING FROM,
 * OUT OF OR IN CONNECTION WITH THE SOFTWARE OR THE USE OR OTHER DEALINGS IN
 * THE SOFTWARE.
 */

#include <stdint.h>
#include "py/runtime.h"
#include "py/gc.h"
#include "py/mphal.h"
// #include "inc/tm4c123gh6pm.h"
#include "inc/hw_memmap.h"
#include "inc/hw_sysctl.h"
#include "inc/hw_gpio.h"
#include "inc/hw_pwm.h"
#include "driverlib/sysctl.h"
#include "driverlib/gpio.h"
#include "driverlib/pin_map.h"
#include "driverlib/pwm.h"
#include "driverlib/interrupt.h"
#include "handlers.h"

#include "pwm.h"
#include "pin.h"

#ifndef PART_TM4C123GH6PM
    #define PART_TM4C123GH6PM
#endif

// individual pwm modules
enum {PWM_M0PWM0, PWM_M0PWM1, PWM_M0PWM2, PWM_M0PWM3, PWM_M0PWM4, PWM_M0PWM5, PWM_M0PWM6, PWM_M0PWM7,
        PWM_M1PWM0, PWM_M1PWM1, PWM_M1PWM2, PWM_M1PWM3, PWM_M1PWM4, PWM_M1PWM5, PWM_M1PWM6, PWM_M1PWM7};

static const uint32_t pwm_periph_reg_map[2] = {SYSCTL_PERIPH_PWM0, SYSCTL_PERIPH_PWM1};
static const uint32_t pwm_mod_reg_map[2] = {PWM0_BASE, PWM1_BASE};
static const uint16_t pwm_gen_reg_map[4] = {PWM_GEN_0, PWM_GEN_1, PWM_GEN_2, PWM_GEN_3};
static const uint16_t pwm_out_reg_map[8] = {PWM_OUT_0, PWM_OUT_1, PWM_OUT_2, PWM_OUT_3, PWM_OUT_4, PWM_OUT_5, PWM_OUT_6, PWM_OUT_7};
static const uint32_t gpio_af_val_map[MICROPY_HW_MAX_PWM][2] = 
{
    {GPIO_PB6_M0PWM0,   0},
    {GPIO_PB7_M0PWM1,   0},
    {GPIO_PB4_M0PWM2,   0},
    {GPIO_PB5_M0PWM3,   0},
    {GPIO_PE4_M0PWM4,   0},
    {GPIO_PE5_M0PWM5,   0},
    {GPIO_PC4_M0PWM6,   GPIO_PD0_M0PWM6},
    {GPIO_PC5_M0PWM7,   GPIO_PD1_M0PWM7},

    {GPIO_PD0_M1PWM0,   0},
    {GPIO_PD1_M1PWM1,   0},
    {GPIO_PA6_M1PWM2,   GPIO_PE4_M1PWM2},
    {GPIO_PA7_M1PWM3,   GPIO_PE5_M1PWM3},
    {GPIO_PF0_M1PWM4,   0},
    {GPIO_PF1_M1PWM5,   0},
    {GPIO_PF2_M1PWM6,   0},
    {GPIO_PF3_M1PWM7,   0},
};

static const uint8_t pwm_pin_num_list[MICROPY_HW_MAX_PWM][2] = 
{
    {1,     0xff},  // 0xff to indicate no alternative pin
    {4,     0xff},
    {58,    0xff},
    {57,    0xff},
    {59,    0xff},
    {60,    0xff},
    {16,    61},
    {15,    62},

    {61,    0xff},
    {62,    0xff},
    {23,    59},
    {24,    60},
    {28,    0xff},
    {29,    0xff},
    {30,    0xff},
    {31,    0xff},
};

typedef struct _machine_pwm_obj_t
{
    mp_obj_base_t       base;
    bool                in_use;

    const pin_obj_t*    pin;            // output pin
    bool                alternate_pin;  // use alternative pwm output pin if available

    uint8_t             id;             // internal id 0..15
    uint8_t             twin_id;        // id of twin pwm in generator
    uint8_t             mod_id;         // pwm module id 0..1
    uint8_t             gen_id;         // pwm generator id 0..3
    
    bool                active;         // output active
    bool                invert;         // output inverted
    uint32_t            freq;           // pwm frequency
    uint16_t            load;           // internal pwm load value
    uint8_t             duty;           // pwm duty 0..100
    mp_obj_t            irq;            // pwm interrupt service callback
    uint16_t            irq_mode;       // pwm interrupt configuration
    uint16_t            db_falling;     // deadband delay falling edge
    uint16_t            db_rising;      // deadband delay rising edge

    uint32_t            mode;           // counting mode

} machine_pwm_obj_t;

static machine_pwm_obj_t machine_pwm_obj[MICROPY_HW_MAX_PWM] = {};
static uint16_t pwm_clk_div_val = PWM_SYSCLK_DIV_1;

void machine_pwm_obj_val_init(machine_pwm_obj_t* self)
{
    self->base.type = &machine_pwm_type;
    self->in_use =          false;
    self->pin =             NULL;
    self->alternate_pin =   false;
    self->active =          false;
    self->invert =          false;
    self->freq =            0;
    self->load =            0;
    self->duty =            0;
    self->irq =             mp_const_none;
    self->irq_mode =        0;
    self->db_falling =      0;
    self->db_rising =       0;
    self->mode =            0;
}

uint8_t pwm_get_id_from_pin(const pin_obj_t* pin, bool alternate_pin)
{
    for (uint8_t i = 0; i < MICROPY_HW_MAX_PWM; i++)
    {
        if (pwm_pin_num_list[i][alternate_pin] == pin->pin_num)
            return i;
    }
    return 0xff;
}

uint8_t get_port_index_from_pin(const pin_obj_t* pin)
{
    return (uint8_t) qstr_str(pin->name)[1] - (uint8_t) 'A';
}

uint8_t get_pin_index_from_pin(const pin_obj_t* pin)
{
    return (uint8_t) qstr_str(pin->name)[2] - (uint8_t) '0';
}

void pwm_update_active(machine_pwm_obj_t* self, bool val)
{
    PWMOutputState(pwm_mod_reg_map[self->mod_id], 1 << (self->id % PWM_M1PWM0), val);
    self->active = val;
}

void pwm_update_invert(machine_pwm_obj_t* self, bool val)
{
    PWMOutputInvert(pwm_mod_reg_map[self->mod_id], 1 << (self->id % PWM_M1PWM0), val);
    self->invert = val;
}

void pwm_update_clock_divider(machine_pwm_obj_t* self, uint16_t val)
{
    if (val == PWM_SYSCLK_DIV_1 || (val >= PWM_SYSCLK_DIV_2 && val <= PWM_SYSCLK_DIV_64))
        PWMClockSet(pwm_mod_reg_map[self->mod_id], val);
    else
        mp_raise_ValueError(MP_ERROR_TEXT("Value out of range"));
    pwm_clk_div_val = val;
}

void pwm_update_freq(machine_pwm_obj_t* self, uint32_t val)
{
    uint32_t sys_freq = SysCtlClockGet();
    uint32_t pwm_freq = sys_freq;
    if (pwm_clk_div_val & PWM_SYSCLK_DIV_2)
        pwm_freq = sys_freq / (2 << (pwm_clk_div_val & PWM_SYSCLK_DIV_2));
    
    if (val * 10 > pwm_freq)
        mp_raise_ValueError(MP_ERROR_TEXT("Value out of range, must be <= sys_clk / clk_div / 10"));

    machine_pwm_obj_t* twin = &machine_pwm_obj[self->twin_id];
    // if twin pwm is active dont allow different frequency
    if (twin->freq && val != twin->freq)
        mp_raise_ValueError(MP_ERROR_TEXT("Frequency must be the same inside one PWM generator"));

    uint32_t load_val = pwm_freq / val;
    if (load_val > 0xffff)
        mp_raise_ValueError(MP_ERROR_TEXT("Frequency to low, consider adjusting the PWM clock divider via PWM.clock_divider(PWM.CLK_DIV_x)"));
    
    PWMGenPeriodSet(pwm_mod_reg_map[self->mod_id], pwm_gen_reg_map[self->gen_id], load_val);
    PWMSyncTimeBase(pwm_mod_reg_map[self->mod_id], 1 << self->gen_id);
    self->load = load_val;
    self->freq = val;
}

