mm399-dev-sw/micropython-tiva/ports/tm4c123/mods/pwm.c
static mp_obj_t machine_pwm_active(size_t n_args, const mp_obj_t* args)
{
    return machine_pwm_active_helper(args[0], n_args - 1, args + 1);
}
static MP_DEFINE_CONST_FUN_OBJ_VAR_BETWEEN(machine_pwm_active_obj, 1, 2, machine_pwm_active);

static mp_obj_t machine_pwm_invert(size_t n_args, const mp_obj_t* args)
{
    return machine_pwm_invert_helper(args[0], n_args - 1, args + 1);
}
static MP_DEFINE_CONST_FUN_OBJ_VAR_BETWEEN(machine_pwm_invert_obj, 1, 2, machine_pwm_invert);

static mp_obj_t machine_pwm_clock_divider(size_t n_args, const mp_obj_t* args)
{
    return machine_pwm_clock_divider_helper(args[0], n_args - 1, args + 1);
}
static MP_DEFINE_CONST_FUN_OBJ_VAR_BETWEEN(machine_pwm_clock_divider_obj, 1, 2, machine_pwm_clock_divider);

static mp_obj_t machine_pwm_freq(size_t n_args, const mp_obj_t* args)
{
    return machine_pwm_freq_helper(args[0], n_args - 1, args + 1);
}
static MP_DEFINE_CONST_FUN_OBJ_VAR_BETWEEN(machine_pwm_freq_obj, 1, 2, machine_pwm_freq);

static mp_obj_t machine_pwm_duty(size_t n_args, const mp_obj_t* args)
{
    return machine_pwm_duty_helper(args[0], n_args - 1, args + 1);
}
static MP_DEFINE_CONST_FUN_OBJ_VAR_BETWEEN(machine_pwm_duty_obj, 1, 2, machine_pwm_duty);

static mp_obj_t machine_pwm_sync(size_t n_args, const mp_obj_t* args)
{
    return machine_pwm_sync_helper(args[0], n_args - 1, args + 1);
}
static MP_DEFINE_CONST_FUN_OBJ_VAR_BETWEEN(machine_pwm_sync_obj, 1, MICROPY_HW_MAX_PWM, machine_pwm_sync);

static mp_obj_t machine_pwm_db(size_t n_args, const mp_obj_t* args, mp_map_t* kw_args)
{
    return machine_pwm_db_helper(args[0], n_args - 1, args + 1, kw_args);
}
static MP_DEFINE_CONST_FUN_OBJ_KW(machine_pwm_db_obj, 1, machine_pwm_db);

static mp_obj_t machine_pwm_irq(size_t n_args, const mp_obj_t* args)
{
    return machine_pwm_irq_helper(args[0], n_args - 1, args + 1);
}
static MP_DEFINE_CONST_FUN_OBJ_VAR_BETWEEN(machine_pwm_irq_obj, 1, 3, machine_pwm_irq);


void pwm_init0(void)
{
    mp_obj_list_init(&MP_STATE_PORT(mp_pwm_obj_list), 0);
    // setup objects frequencies for correct initialization later
    for (uint8_t i = 0; i < MICROPY_HW_MAX_PWM; i++)
    {
        machine_pwm_obj_val_init(&machine_pwm_obj[i]);
        machine_pwm_obj[i].id =         i;
        machine_pwm_obj[i].twin_id =    (i % 2 ? i - 1: i + 1);
        machine_pwm_obj[i].mod_id =     !(i < PWM_M1PWM0);
        machine_pwm_obj[i].gen_id =     ((i % PWM_M1PWM0) - (i % 2)) / 2;
    }
}

static void machine_pwm_print(const mp_print_t* print, mp_obj_t self_in, mp_print_kind_t kind)
{
    machine_pwm_obj_t* self = MP_OBJ_TO_PTR(self_in);
    mp_printf(print, "PWM(Pin(%s), id = %u, mode = %u, active = %u, invert = %u, freq = %lu, duty = %u, irq = %s, db_falling = %lu, db_rising = %lu)",
               (self->pin ? qstr_str(self->pin->name): "None"), self->id, self->mode, self->active, self->invert, self->freq, self->duty, "None", self->db_falling, self->db_rising);
}

static const mp_rom_map_elem_t machine_pwm_locals_dict_table[] = 
{
    // class methods
    {MP_ROM_QSTR(MP_QSTR_init),             MP_ROM_PTR(&machine_pwm_init_obj)},
    {MP_ROM_QSTR(MP_QSTR_deinit),           MP_ROM_PTR(&machine_pwm_deinit_obj)},
    {MP_ROM_QSTR(MP_QSTR_active),           MP_ROM_PTR(&machine_pwm_active_obj)},
    {MP_ROM_QSTR(MP_QSTR_invert),           MP_ROM_PTR(&machine_pwm_invert_obj)},
    {MP_ROM_QSTR(MP_QSTR_clock_divider),    MP_ROM_PTR(&machine_pwm_clock_divider_obj)},
    {MP_ROM_QSTR(MP_QSTR_freq),             MP_ROM_PTR(&machine_pwm_freq_obj)},
    {MP_ROM_QSTR(MP_QSTR_duty),             MP_ROM_PTR(&machine_pwm_duty_obj)},
    {MP_ROM_QSTR(MP_QSTR_sync),             MP_ROM_PTR(&machine_pwm_sync_obj)},
    {MP_ROM_QSTR(MP_QSTR_db),               MP_ROM_PTR(&machine_pwm_db_obj)},
    {MP_ROM_QSTR(MP_QSTR_irq),              MP_ROM_PTR(&machine_pwm_irq_obj)},

    // class constants
    // pwm identifier
    {MP_ROM_QSTR(MP_QSTR_M0PWM0),           MP_ROM_INT(PWM_M0PWM0)},
    {MP_ROM_QSTR(MP_QSTR_M0PWM1),           MP_ROM_INT(PWM_M0PWM1)},
    {MP_ROM_QSTR(MP_QSTR_M0PWM2),           MP_ROM_INT(PWM_M0PWM2)},
    {MP_ROM_QSTR(MP_QSTR_M0PWM3),           MP_ROM_INT(PWM_M0PWM3)},
    {MP_ROM_QSTR(MP_QSTR_M0PWM4),           MP_ROM_INT(PWM_M0PWM4)},
    {MP_ROM_QSTR(MP_QSTR_M0PWM5),           MP_ROM_INT(PWM_M0PWM5)},
    {MP_ROM_QSTR(MP_QSTR_M0PWM6),           MP_ROM_INT(PWM_M0PWM6)},
    {MP_ROM_QSTR(MP_QSTR_M0PWM7),           MP_ROM_INT(PWM_M0PWM7)},
    {MP_ROM_QSTR(MP_QSTR_M1PWM0),           MP_ROM_INT(PWM_M1PWM0)},
    {MP_ROM_QSTR(MP_QSTR_M1PWM1),           MP_ROM_INT(PWM_M1PWM1)},
    {MP_ROM_QSTR(MP_QSTR_M1PWM2),           MP_ROM_INT(PWM_M1PWM2)},
    {MP_ROM_QSTR(MP_QSTR_M1PWM3),           MP_ROM_INT(PWM_M1PWM3)},
    {MP_ROM_QSTR(MP_QSTR_M1PWM4),           MP_ROM_INT(PWM_M1PWM4)},
    {MP_ROM_QSTR(MP_QSTR_M1PWM5),           MP_ROM_INT(PWM_M1PWM5)},
    {MP_ROM_QSTR(MP_QSTR_M1PWM6),           MP_ROM_INT(PWM_M1PWM6)},
    {MP_ROM_QSTR(MP_QSTR_M1PWM7),           MP_ROM_INT(PWM_M1PWM7)},

    // pwm mode options
    {MP_ROM_QSTR(MP_QSTR_MODE_COUNT_DOWN),      MP_ROM_INT(PWM_GEN_MODE_DOWN)},
    {MP_ROM_QSTR(MP_QSTR_MODE_COUNT_UP_DOWN),   MP_ROM_INT(PWM_GEN_MODE_UP_DOWN)},
    {MP_ROM_QSTR(MP_QSTR_MODE_COUNT_UP_DOWN),   MP_ROM_INT(PWM_GEN_MODE_UP_DOWN)},
    {MP_ROM_QSTR(MP_QSTR_MODE_SYNC),            MP_ROM_INT(PWM_GEN_MODE_SYNC)},
    {MP_ROM_QSTR(MP_QSTR_MODE_NO_SYNC),         MP_ROM_INT(PWM_GEN_MODE_NO_SYNC)},
    {MP_ROM_QSTR(MP_QSTR_MODE_DBG_RUN),         MP_ROM_INT(PWM_GEN_MODE_DBG_RUN)},
    {MP_ROM_QSTR(MP_QSTR_MODE_DBG_STOP),        MP_ROM_INT(PWM_GEN_MODE_DBG_STOP)},
    {MP_ROM_QSTR(MP_QSTR_MODE_DB_NO_SYNC),      MP_ROM_INT(PWM_GEN_MODE_DB_NO_SYNC)},
    {MP_ROM_QSTR(MP_QSTR_MODE_DB_SYNC_LOCAL),   MP_ROM_INT(PWM_GEN_MODE_DB_SYNC_LOCAL)},
    {MP_ROM_QSTR(MP_QSTR_MODE_DB_SYNC_GLOBAL),  MP_ROM_INT(PWM_GEN_MODE_DB_SYNC_GLOBAL)},
    {MP_ROM_QSTR(MP_QSTR_MODE_GEN_NO_SYNC),     MP_ROM_INT(PWM_GEN_MODE_GEN_NO_SYNC)},
    {MP_ROM_QSTR(MP_QSTR_MODE_GEN_SYNC_LOCAL),  MP_ROM_INT(PWM_GEN_MODE_GEN_SYNC_LOCAL)},
    {MP_ROM_QSTR(MP_QSTR_MODE_GEN_SYNC_GLOBAL), MP_ROM_INT(PWM_GEN_MODE_GEN_SYNC_GLOBAL)},

    // pwm clock divider
    {MP_ROM_QSTR(MP_QSTR_CLK_DIV_1),            MP_ROM_INT(PWM_SYSCLK_DIV_1)},
    {MP_ROM_QSTR(MP_QSTR_CLK_DIV_2),            MP_ROM_INT(PWM_SYSCLK_DIV_2)},
    {MP_ROM_QSTR(MP_QSTR_CLK_DIV_4),            MP_ROM_INT(PWM_SYSCLK_DIV_4)},
    {MP_ROM_QSTR(MP_QSTR_CLK_DIV_8),            MP_ROM_INT(PWM_SYSCLK_DIV_8)},
    {MP_ROM_QSTR(MP_QSTR_CLK_DIV_16),           MP_ROM_INT(PWM_SYSCLK_DIV_16)},
    {MP_ROM_QSTR(MP_QSTR_CLK_DIV_32),           MP_ROM_INT(PWM_SYSCLK_DIV_32)},
    {MP_ROM_QSTR(MP_QSTR_CLK_DIV_64),           MP_ROM_INT(PWM_SYSCLK_DIV_64)},

    // pwm irq options
    {MP_ROM_QSTR(MP_QSTR_IRQ_INT_CNT_ZERO),     MP_ROM_INT(PWM_INT_CNT_ZERO)},
    {MP_ROM_QSTR(MP_QSTR_IRQ_INT_CNT_LOAD),     MP_ROM_INT(PWM_INT_CNT_LOAD)},
    {MP_ROM_QSTR(MP_QSTR_IRQ_INT_CNT_AU),       MP_ROM_INT(PWM_INT_CNT_AU)},
    {MP_ROM_QSTR(MP_QSTR_IRQ_INT_CNT_AD),       MP_ROM_INT(PWM_INT_CNT_AD)},
    {MP_ROM_QSTR(MP_QSTR_IRQ_INT_CNT_BU),       MP_ROM_INT(PWM_INT_CNT_BU)},
    {MP_ROM_QSTR(MP_QSTR_IRQ_INT_CNT_BD),       MP_ROM_INT(PWM_INT_CNT_BD)},
    {MP_ROM_QSTR(MP_QSTR_IRQ_TR_CNT_ZERO),      MP_ROM_INT(PWM_TR_CNT_ZERO)},
    {MP_ROM_QSTR(MP_QSTR_IRQ_TR_CNT_LOAD),      MP_ROM_INT(PWM_TR_CNT_LOAD)},
    {MP_ROM_QSTR(MP_QSTR_IRQ_TR_CNT_AU),        MP_ROM_INT(PWM_TR_CNT_AU)},
    {MP_ROM_QSTR(MP_QSTR_IRQ_TR_CNT_AD),        MP_ROM_INT(PWM_TR_CNT_AD)},
    {MP_ROM_QSTR(MP_QSTR_IRQ_TR_CNT_BU),        MP_ROM_INT(PWM_TR_CNT_BU)},
    {MP_ROM_QSTR(MP_QSTR_IRQ_TR_CNT_BD),        MP_ROM_INT(PWM_TR_CNT_BD)},
};
static MP_DEFINE_CONST_DICT(machine_pwm_locals_dict, machine_pwm_locals_dict_table);

const mp_obj_type_t machine_pwm_type = 
{
    { &mp_type_type },
    .name = MP_QSTR_PWM,
    .print = machine_pwm_print,
    .make_new = mp_machine_pwm_make_new,
    .locals_dict = (mp_obj_dict_t*) &machine_pwm_locals_dict,
};
